/*
Конкатенация - это объединение двух или более строк в одну большую.
Объединение происходит с помощью оператора + (плюс). При конкатенации
 каждая последующая строка добавляется в конец предыдущей:
Значение любого типа, которое объединяется со строкой, будет неявно 
(автоматически) преобразовано в строку и далее будет произведена конкатенация.
*/


var hi = 'Hello';
var nameUser = 'Asel';
alert('big' + 'dog');
alert('big' + ' ' + 'dog');
alert('big' + ' dog');
alert(hi + ' как у тебя дела ' + nameUser);