let text = 'Бесплатный сервис Google позволяет мгновенно переводить слова';
document.write(text.length);
document.write(' <br>   ' + text);
document.write(' <br>      ' + text.slice(0, 5));
document.write('<br>' + text.slice(4, 11));
let text2 = 'Изучайте времена и формы глаголов в английском, немецком, испанском, французском и русском языках в разделе Спряжение и склонение. Учите употребление слов и выражений в разных Контекстах. Мы собрали для вас миллионы примеров перевода на разные языки, которые помогут вам в изучении иностранных языков и подготовке домашних заданий.'

document.write('<br>' + text2.slice(0, 80));