/*
Вы можете назвать переменную как угодно, но есть ограничения. Как правило, вы должны придерживаться только латинских символов (0-9, a-z, A-Z) и символа подчёркивания.

Не рекомендуется использование других символов, потому что они могут вызывать ошибки или быть непонятными для международной аудитории.
Не используйте символы подчёркивания в начале имён переменных - это используется в некоторых конструкциях JavaScript для обозначения конкретных вещей.
Не используйте числа в начале переменных. Это недопустимо и приведёт к ошибке.
Общепринято придерживаться так называемый "lower camel case", где вы склеиваете несколько слов, используя строчные буквы для всего первого слова, а затем заглавные 
буквы последующих слов. Мы использовали это для наших имён переменных в этой статье.
Делайте имена переменных такими, чтобы было интуитивно понятно, какие данные они содержат. Не используйте только отдельные буквы / цифры или большие длинные фразы.
Переменные чувствительны к регистру, так что myage и myAge - разные переменные.
И последнее - вам также нужно избегать использования зарезервированных слов JavaScript в качестве имён переменных - под этим мы подразумеваем слова, которые составляют 
фактический синтаксис JavaScript! Таким образом, вы не можете использовать слова типа var, function, let,
 и for для имён переменных. Браузеры распознают их как разные элементы кода, и поэтому возникают ошибки.
*/

let name = 'Asel';
let nameUser = 'Asel';
let name25 = 'Asel';
let nameAge = 35;